astb_relise/src/Documents/ЗаписьНаСклад/ЗаписьНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьНаСклад</name>
  <registerRecords>InformationRegister.ЗаписиНаСклад</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

astb_relise/src/InformationRegisters/ЗаписиНаСклад/ЗаписиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиНаСклад</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/ЗаписьНаСклад/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	СтруктураИнформацииОСтаройЗаписи = ПолучитьИнформациюОСтаройЗаписи(ДокументСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаписьНаСклад.Дата КАК Период,
	|	ЗаписьНаСклад.Организация КАК Организация,
	|	ЗаписьНаСклад.Склад КАК Склад,
	|	&СтарыйДень КАК День,
	|	ЗаписьНаСклад.Сотрудник КАК Сотрудник,
	|	&СтароеВремя КАК Время,
	|	ЛОЖЬ КАК Использовать
	|ИЗ
	|	Документ.ЗаписьНаСклад КАК ЗаписьНаСклад
	|ГДЕ
	|	ЗаписьНаСклад.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписьНаСклад.Дата КАК Период,
	|	ЗаписьНаСклад.Организация КАК Организация,
	|	ЗаписьНаСклад.Сотрудник КАК Сотрудник,
	|	ЗаписьНаСклад.Склад КАК Склад,
	|	ЗаписьНаСклад.День КАК День,
	|	ЗаписьНаСклад.Время КАК Время,
	|	ИСТИНА КАК Использовать
	|ИЗ
	|	Документ.ЗаписьНаСклад КАК ЗаписьНаСклад
	|ГДЕ
	|	ЗаписьНаСклад.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",			ДокументСсылка);
	Запрос.УстановитьПараметр("СтарыйДень",		СтруктураИнформацииОСтаройЗаписи.СтараяЗаписьДень);
	Запрос.УстановитьПараметр("СтароеВремя",	СтруктураИнформацииОСтаройЗаписи.СтараяЗаписьВремя);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаСтаройЗаписи = Результат[0].Выгрузить();
	ТаблицаНовойЗаписи 	= Результат[1].Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Если ЗначениеЗаполнено(СтруктураИнформацииОСтаройЗаписи.СтараяЗаписьДень) Тогда
	 	Если ЗначениеЗаполнено(ДокументСсылка.День) И ЗначениеЗаполнено(ДокументСсылка.Время) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаНовойЗаписи,ТаблицаСтаройЗаписи);
		КонецЕсли;	
		ТаблицыДляДвижений.Вставить("ТаблицаЗаписиНаСклад", ТаблицаСтаройЗаписи);
	Иначе
		Если ЗначениеЗаполнено(ДокументСсылка.День) И ЗначениеЗаполнено(ДокументСсылка.Время) Тогда 
			ТаблицыДляДвижений.Вставить("ТаблицаЗаписиНаСклад", ТаблицаНовойЗаписи);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьИнформациюОСтаройЗаписи(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЗаписиНаСкладСрезПоследних.День) КАК День,
	|	МАКСИМУМ(ЗаписиНаСкладСрезПоследних.Время) КАК Время
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	РегистрСведений.ЗаписиНаСклад.СрезПоследних(
	|			&ПериодАнализа,
	|			Организация = &Организация
	|				И Склад = &Склад
	|				И Сотрудник = &Сотрудник
	|				И День >= &День) КАК ЗаписиНаСкладСрезПоследних
	|ГДЕ
	|	ЗаписиНаСкладСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.День КАК День,
	|	ВТ_Результат.Время КАК Время
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	НЕ ВТ_Результат.День ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодАнализа", 	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Склад",			ТекущийОбъект.Склад);
	Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
	Запрос.УстановитьПараметр("День",			НачалоДня(ТекущийОбъект.Дата));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СтараяЗаписьДень 	= Дата(1,1,1,0,0,0);
		СтараяЗаписьВремя 	= Дата(1,1,1,0,0,0);
	Иначе
		ТаблицаЗапроса 		= Результат.Выгрузить();
		СтараяЗаписьДень 	= ТаблицаЗапроса[0].День;
		СтараяЗаписьВремя 	= ТаблицаЗапроса[0].Время;
	КонецЕсли;
	
	Возврат Новый Структура("СтараяЗаписьДень, СтараяЗаписьВремя", СтараяЗаписьДень, СтараяЗаписьВремя);
	
КонецФункции	

#КонецЕсли
